{"keras_version": "1.1.2", "config": [{"config": {"arguments": {}, "output_shape_type": "raw", "input_dtype": "float32", "function_type": "lambda", "trainable": true, "output_shape": [64, 64, 3], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\u0011model-balanced.py\u00da\b<lambda>\u00c7\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "batch_input_shape": [null, 64, 64, 3], "name": "lambda_1"}, "class_name": "Lambda"}, {"config": {"nb_col": 1, "b_constraint": null, "activation": "linear", "init": "glorot_uniform", "subsample": [1, 1], "trainable": true, "activity_regularizer": null, "W_constraint": null, "bias": true, "border_mode": "same", "dim_ordering": "tf", "name": "convolution2d_1", "nb_filter": 3, "b_regularizer": null, "nb_row": 1, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"nb_col": 3, "b_constraint": null, "activation": "linear", "init": "glorot_uniform", "subsample": [1, 1], "trainable": true, "activity_regularizer": null, "W_constraint": null, "bias": true, "border_mode": "same", "dim_ordering": "tf", "name": "convolution2d_2", "nb_filter": 32, "b_regularizer": null, "nb_row": 3, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "dim_ordering": "tf", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "name": "maxpooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "elu_1", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"nb_col": 3, "b_constraint": null, "activation": "linear", "init": "glorot_uniform", "subsample": [1, 1], "trainable": true, "activity_regularizer": null, "W_constraint": null, "bias": true, "border_mode": "same", "dim_ordering": "tf", "name": "convolution2d_3", "nb_filter": 64, "b_regularizer": null, "nb_row": 3, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "dim_ordering": "tf", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "name": "maxpooling2d_2"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "elu_2", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"nb_col": 3, "b_constraint": null, "activation": "linear", "init": "glorot_uniform", "subsample": [1, 1], "trainable": true, "activity_regularizer": null, "W_constraint": null, "bias": true, "border_mode": "same", "dim_ordering": "tf", "name": "convolution2d_4", "nb_filter": 128, "b_regularizer": null, "nb_row": 3, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "dim_ordering": "tf", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "name": "maxpooling2d_3"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "elu_3", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"init": "glorot_uniform", "b_constraint": null, "input_dim": null, "trainable": true, "activity_regularizer": null, "name": "dense_1", "W_constraint": null, "bias": true, "activation": "linear", "b_regularizer": null, "W_regularizer": null, "output_dim": 512}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "elu_4", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"init": "glorot_uniform", "b_constraint": null, "input_dim": null, "trainable": true, "activity_regularizer": null, "name": "dense_2", "W_constraint": null, "bias": true, "activation": "linear", "b_regularizer": null, "W_regularizer": null, "output_dim": 64}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "elu_5", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"init": "glorot_uniform", "b_constraint": null, "input_dim": null, "trainable": true, "activity_regularizer": null, "name": "dense_3", "W_constraint": null, "bias": true, "activation": "linear", "b_regularizer": null, "W_regularizer": null, "output_dim": 16}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "elu_6", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"init": "glorot_uniform", "b_constraint": null, "input_dim": null, "trainable": true, "activity_regularizer": null, "name": "dense_4", "W_constraint": null, "bias": true, "activation": "linear", "b_regularizer": null, "W_regularizer": null, "output_dim": 1}, "class_name": "Dense"}], "class_name": "Sequential"}