{"class_name": "Sequential", "keras_version": "1.1.2", "config": [{"class_name": "Lambda", "config": {"function_type": "lambda", "trainable": true, "output_shape_type": "raw", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\u0011model-balanced.py\u00da\b<lambda>\t\u0001\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "input_dtype": "float32", "batch_input_shape": [null, 64, 64, 3], "output_shape": [64, 64, 3], "arguments": {}, "name": "lambda_1"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "trainable": true, "nb_filter": 3, "activation": "linear", "bias": true, "nb_row": 1, "b_constraint": null, "nb_col": 1, "b_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform", "border_mode": "same", "name": "convolution2d_1", "activity_regularizer": null, "W_constraint": null, "subsample": [1, 1]}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "trainable": true, "nb_filter": 32, "activation": "linear", "bias": true, "nb_row": 3, "b_constraint": null, "nb_col": 3, "b_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform", "border_mode": "same", "name": "convolution2d_2", "activity_regularizer": null, "W_constraint": null, "subsample": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "dim_ordering": "tf", "strides": [2, 2], "pool_size": [2, 2], "name": "maxpooling2d_1", "border_mode": "valid"}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_1"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "trainable": true, "nb_filter": 64, "activation": "linear", "bias": true, "nb_row": 3, "b_constraint": null, "nb_col": 3, "b_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform", "border_mode": "same", "name": "convolution2d_3", "activity_regularizer": null, "W_constraint": null, "subsample": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "dim_ordering": "tf", "strides": [2, 2], "pool_size": [2, 2], "name": "maxpooling2d_2", "border_mode": "valid"}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_2"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "trainable": true, "nb_filter": 128, "activation": "linear", "bias": true, "nb_row": 3, "b_constraint": null, "nb_col": 3, "b_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform", "border_mode": "same", "name": "convolution2d_4", "activity_regularizer": null, "W_constraint": null, "subsample": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "dim_ordering": "tf", "strides": [2, 2], "pool_size": [2, 2], "name": "maxpooling2d_3", "border_mode": "valid"}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_3"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "trainable": true, "input_dim": null, "activation": "linear", "bias": true, "output_dim": 512, "b_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "name": "dense_1", "activity_regularizer": null, "W_constraint": null}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_4"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "trainable": true, "input_dim": null, "activation": "linear", "bias": true, "output_dim": 64, "b_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "name": "dense_2", "activity_regularizer": null, "W_constraint": null}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_5"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "trainable": true, "input_dim": null, "activation": "linear", "bias": true, "output_dim": 16, "b_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "name": "dense_3", "activity_regularizer": null, "W_constraint": null}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_6"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "trainable": true, "input_dim": null, "activation": "linear", "bias": true, "output_dim": 1, "b_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "name": "dense_4", "activity_regularizer": null, "W_constraint": null}}]}